Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>T43MRqDZM3Ax/FsZhiqJ793kR2Ds8RKwwPO5KiSVCEJRNsb2Tvgf72Byv0zZIzIX1Fuq7PNdwkl2&#13;
PC4j4Dj6iLCRI/UW8ITq0TCYkaBb/GXVJN6AvqRlOayfodD2wyWFMsDcwjVHOfkAK/cKSkCaFwjn&#13;
f3ebLcG8wvDMFULEe4sULSxSQk+nDG3sn2WYCSoMnKmougewumKKqkEHJTl8TPNXe86QKsRq+Wk8&#13;
q3uL2mziV3J6Jt7Ag8UrFsAw+G9DFdxCqYS0YFgXjcZ/FuSbu38mGsuUGOGAnhbwYMlqaSrJtmtS&#13;
LNBx9aaWYUpb0JacD1OxXVMLQB+ZcF26T+RvDg==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>WykzUl0rHlGR0KAmtiVvv4OL6MMiziDW3oThD+gd6IuRbGGTZk+7pfZ3UjbowtLeK7GEJ/c3vLj/&#13;
gMa8Pwdhj/72Jewln3m515VM9WCOtCkOvuT+fptkAJwLaMCmp4TSDk43dxm+8G7i9SONLQJTwOwi&#13;
lciRZpcitKilxiSWKjS6IvuUdKggri/L/wW8Obgdee13yoXr2gWRdCpQpUZzKd6sve6p9BWtg/IS&#13;
4O7HVXuY7VNMaWibRzLdXt7CCHKSWJvdIusKM8ZDsFVwA5GqQL5ZU7JmMd9iJ2RrovM8tgoqIHCP&#13;
IYprKio9xcX5/I67BQhuyuSAeZ8EQLz4JBJr8xRjZPdfd5KNXnacXk5zCwxQMAfLrYSisvk8mnEN&#13;
iDHDniBrZ2CDmXOgeKyHGZS4PdiNR6kNo/xU/O/pq99cgVETjIl9bkGRJj1NSsfw2xWwoRU/5x+C&#13;
Yr7yPhplnyFnlTQ0RsCghU3dBaLabgDA4RSp5ATOYeqfeY3wgPHNjSL5MxxL1lAmDo1eJWZvcZ7M&#13;
WLs0r+2BvrZembYXB4QyY8eR9v+E9BgvuBODxEe7338f+Ez9VpJE7i73ktHqzgSK9Wxv4m+HoxLH&#13;
vTO+NFdzvtV4Par9jHvxs+t+uW3wl5QJqoiBUdZcjNCwG0BF92FxbjgobBagJWUwDw/FiNuFCBuG&#13;
oWKv2XJqW+YkqYyetfEV+3EPm9MfDMYI6vS/YTB2EqDN3Vwl9cCn0xl7yHOIgXV/o+X2yO/OCjxx&#13;
rdHxyZpc7XTaPNWpx7NK7MbDiZl4COgoW/pVqGmbcajD10UUKHYcSsNRP8rYWIJHq8ZjQxT2XWQj&#13;
dBUBc3xiKkZpLJUE/3x+nEfKjSeyowTC61yVoOPjvklXncFHbSY0FVj6UiTLhzJX0MsoT/5sqJDx&#13;
r73xpJ4uy5X+hKXpiqUACx6ZgekYsfwjdxPngxuuhvxysiRT</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>mCEC5y4+LsOhsuuLWmQELuSqgOY=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
OUc430HQPDCbCF4+eCUtyvLgmwG+bOBiCnVzjYiyaIPwEOB44kfXYXoKYtQXTMgo+ye2h6sdpvy+&#13;
s3YxYhOLbZjHMnTXSuPFgCDi+3CH2qsH63Z+vqS1ZOcesBLOqYMcepZPmnpy5oeXD3RNUpMkYOfC&#13;
dZMNqd0HtC2xaUCAbxuKD9WsasDfLyRtO+u23jqGdbJhIgt7OUgC69/SEbbjF7XhZ6+uCS5C7BnB&#13;
d7+ol2XF3u2h5SZIzSLTfu0ezYJTBJ/y+SEnUq5G7FBxYbY70TNYLlPNFPh3VqPIgJNR+iD3CLU6&#13;
+wjOy4uQgV85mEACYY7cHh/UcqZD71poIwZzsw==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>